{
    "abstract": "We consider the probabilistic simplex-constrained sparse recovery problem. The commonly used Lasso-type penalty for promoting sparsity is ineffective in this context since it is a constant within the simplex. Despite this challenge, fortunately, simplex constraint itself brings a self-regularization property, i.e., the empirical risk minimizer without any sparsity-promoting procedure obtains the usual Lasso-type estimation error. Moreover, we analyze the iterates of a projected gradient descent method and show its convergence to the ground truth sparse solution in the geometric rate until a satisfied statistical precision is attained. Although the estimation error is statistically optimal, the resulting solution is usually more dense than the sparse ground truth. To further sparsify the iterates, we propose a method called PERMITS via embedding a tail screening procedure, i.e., identifying negligible components and discarding them during iterations, into the projected gradient descent method. Furthermore, we combine tail screening and the special information criterion to balance the trade-off between fitness and complexity. Theoretically, the proposed PERMITS method can exactly recover the ground truth support set under mild conditions and thus obtain the oracle property. We demonstrate the statistical and computational efficiency of PERMITS with both synthetic and real data. The implementation of the proposed method can be found in https://github.com/abess-team/PERMITS.",
    "authors": [
        "Peng Chen",
        "Jin Zhu",
        "Junxian Zhu",
        "Xueqin Wang"
    ],
    "emails": [
        "chenpeng1@mail.ustc.edu.cn",
        "j.zhu69@lse.ac.uk",
        "junxian@nus.edu.sg",
        "wangxq20@ustc.edu.cn"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/abess-team/PERMITS"
        ]
    ],
    "id": "24-0010",
    "issue": 159,
    "pages": [
        1,
        38
    ],
    "title": "Simplex Constrained Sparse Optimization via Tail Screening",
    "volume": 26,
    "year": 2025
}